dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f76x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32F76x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32F76x_PINMUX_H_)
# define _STM32F76x_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define CAN2_RX_FUNC             2
#define CAN2_TX_FUNC             3
#define CAN3_RX_FUNC             4
#define CAN3_TX_FUNC             5
#define CEC_FUNC                 6
#define DCMI_D0_FUNC             7
#define DCMI_D1_FUNC             8
#define DCMI_D10_FUNC            9
#define DCMI_D11_FUNC            10
#define DCMI_D12_FUNC            11
#define DCMI_D13_FUNC            12
#define DCMI_D2_FUNC             13
#define DCMI_D3_FUNC             14
#define DCMI_D4_FUNC             15
#define DCMI_D5_FUNC             16
#define DCMI_D6_FUNC             17
#define DCMI_D7_FUNC             18
#define DCMI_D8_FUNC             19
#define DCMI_D9_FUNC             20
#define DCMI_HSYNC_FUNC          21
#define DCMI_PIXCLK_FUNC         22
#define DCMI_VSYNC_FUNC          23
#define DFSDM1_CKIN0_FUNC        24
#define DFSDM1_CKIN1_FUNC        25
#define DFSDM1_CKIN2_FUNC        26
#define DFSDM1_CKIN3_FUNC        27
#define DFSDM1_CKIN4_FUNC        28
#define DFSDM1_CKIN5_FUNC        29
#define DFSDM1_CKIN6_FUNC        30
#define DFSDM1_CKIN7_FUNC        31
#define DFSDM1_CKOUT_FUNC        32
#define DFSDM1_DATIN0_FUNC       33
#define DFSDM1_DATIN1_FUNC       34
#define DFSDM1_DATIN2_FUNC       35
#define DFSDM1_DATIN3_FUNC       36
#define DFSDM1_DATIN4_FUNC       37
#define DFSDM1_DATIN5_FUNC       38
#define DFSDM1_DATIN6_FUNC       39
#define DFSDM1_DATIN7_FUNC       40
#define DSIHOST_TE_FUNC          41
#define ETH_COL_FUNC             42
#define ETH_CRS_FUNC             43
#define ETH_CRS_DV_FUNC          44
#define ETH_MDC_FUNC             45
#define ETH_MDIO_FUNC            46
#define ETH_PPS_OUT_FUNC         47
#define ETH_REF_CLK_FUNC         48
#define ETH_RXD0_FUNC            49
#define ETH_RXD1_FUNC            50
#define ETH_RXD2_FUNC            51
#define ETH_RXD3_FUNC            52
#define ETH_RX_CLK_FUNC          53
#define ETH_RX_DV_FUNC           54
#define ETH_RX_ER_FUNC           55
#define ETH_TXD0_FUNC            56
#define ETH_TXD1_FUNC            57
#define ETH_TXD2_FUNC            58
#define ETH_TXD3_FUNC            59
#define ETH_TX_CLK_FUNC          60
#define ETH_TX_EN_FUNC           61
#define FMC_A0_FUNC              62
#define FMC_A1_FUNC              63
#define FMC_A10_FUNC             64
#define FMC_A11_FUNC             65
#define FMC_A12_FUNC             66
#define FMC_A13_FUNC             67
#define FMC_A14_FUNC             68
#define FMC_A15_FUNC             69
#define FMC_A16_FUNC             70
#define FMC_A17_FUNC             71
#define FMC_A18_FUNC             72
#define FMC_A19_FUNC             73
#define FMC_A2_FUNC              74
#define FMC_A20_FUNC             75
#define FMC_A21_FUNC             76
#define FMC_A22_FUNC             77
#define FMC_A23_FUNC             78
#define FMC_A24_FUNC             79
#define FMC_A25_FUNC             80
#define FMC_A3_FUNC              81
#define FMC_A4_FUNC              82
#define FMC_A5_FUNC              83
#define FMC_A6_FUNC              84
#define FMC_A7_FUNC              85
#define FMC_A8_FUNC              86
#define FMC_A9_FUNC              87
#define FMC_ALE_FUNC             88
#define FMC_BA0_FUNC             89
#define FMC_BA1_FUNC             90
#define FMC_CLE_FUNC             91
#define FMC_CLK_FUNC             92
#define FMC_D0_FUNC              93
#define FMC_D1_FUNC              94
#define FMC_D10_FUNC             95
#define FMC_D11_FUNC             96
#define FMC_D12_FUNC             97
#define FMC_D13_FUNC             98
#define FMC_D14_FUNC             99
#define FMC_D15_FUNC             100
#define FMC_D16_FUNC             101
#define FMC_D17_FUNC             102
#define FMC_D18_FUNC             103
#define FMC_D19_FUNC             104
#define FMC_D2_FUNC              105
#define FMC_D20_FUNC             106
#define FMC_D21_FUNC             107
#define FMC_D22_FUNC             108
#define FMC_D23_FUNC             109
#define FMC_D24_FUNC             110
#define FMC_D25_FUNC             111
#define FMC_D26_FUNC             112
#define FMC_D27_FUNC             113
#define FMC_D28_FUNC             114
#define FMC_D29_FUNC             115
#define FMC_D3_FUNC              116
#define FMC_D30_FUNC             117
#define FMC_D31_FUNC             118
#define FMC_D4_FUNC              119
#define FMC_D5_FUNC              120
#define FMC_D6_FUNC              121
#define FMC_D7_FUNC              122
#define FMC_D8_FUNC              123
#define FMC_D9_FUNC              124
#define FMC_DA0_FUNC             125
#define FMC_DA1_FUNC             126
#define FMC_DA10_FUNC            127
#define FMC_DA11_FUNC            128
#define FMC_DA12_FUNC            129
#define FMC_DA13_FUNC            130
#define FMC_DA14_FUNC            131
#define FMC_DA15_FUNC            132
#define FMC_DA2_FUNC             133
#define FMC_DA3_FUNC             134
#define FMC_DA4_FUNC             135
#define FMC_DA5_FUNC             136
#define FMC_DA6_FUNC             137
#define FMC_DA7_FUNC             138
#define FMC_DA8_FUNC             139
#define FMC_DA9_FUNC             140
#define FMC_INT_FUNC             141
#define FMC_NBL0_FUNC            142
#define FMC_NBL1_FUNC            143
#define FMC_NBL2_FUNC            144
#define FMC_NBL3_FUNC            145
#define FMC_NCE_FUNC             146
#define FMC_NE1_FUNC             147
#define FMC_NE2_FUNC             148
#define FMC_NE3_FUNC             149
#define FMC_NE4_FUNC             150
#define FMC_NL_FUNC              151
#define FMC_NOE_FUNC             152
#define FMC_NWAIT_FUNC           153
#define FMC_NWE_FUNC             154
#define FMC_SDCKE0_FUNC          155
#define FMC_SDCKE1_FUNC          156
#define FMC_SDCLK_FUNC           157
#define FMC_SDNCAS_FUNC          158
#define FMC_SDNE0_FUNC           159
#define FMC_SDNE1_FUNC           160
#define FMC_SDNRAS_FUNC          161
#define FMC_SDNWE_FUNC           162
#define I2C1_SCL_FUNC            163
#define I2C1_SDA_FUNC            164
#define I2C1_SMBA_FUNC           165
#define I2C2_SCL_FUNC            166
#define I2C2_SDA_FUNC            167
#define I2C2_SMBA_FUNC           168
#define I2C3_SCL_FUNC            169
#define I2C3_SDA_FUNC            170
#define I2C3_SMBA_FUNC           171
#define I2C4_SCL_FUNC            172
#define I2C4_SDA_FUNC            173
#define I2C4_SMBA_FUNC           174
#define I2S1_CK_FUNC             175
#define I2S1_MCK_FUNC            176
#define I2S1_SD_FUNC             177
#define I2S1_WS_FUNC             178
#define I2S2_CK_FUNC             179
#define I2S2_MCK_FUNC            180
#define I2S2_SD_FUNC             181
#define I2S2_WS_FUNC             182
#define I2S3_CK_FUNC             183
#define I2S3_MCK_FUNC            184
#define I2S3_SD_FUNC             185
#define I2S3_WS_FUNC             186
#define I2S_CKIN_FUNC            187
#define LPTIM1_ETR_FUNC          188
#define LPTIM1_IN1_FUNC          189
#define LPTIM1_IN2_FUNC          190
#define LPTIM1_OUT_FUNC          191
#define LTDC_B0_FUNC             192
#define LTDC_B1_FUNC             193
#define LTDC_B2_FUNC             194
#define LTDC_B3_FUNC             195
#define LTDC_B4_FUNC             196
#define LTDC_B5_FUNC             197
#define LTDC_B6_FUNC             198
#define LTDC_B7_FUNC             199
#define LTDC_CLK_FUNC            200
#define LTDC_DE_FUNC             201
#define LTDC_G0_FUNC             202
#define LTDC_G1_FUNC             203
#define LTDC_G2_FUNC             204
#define LTDC_G3_FUNC             205
#define LTDC_G4_FUNC             206
#define LTDC_G5_FUNC             207
#define LTDC_G6_FUNC             208
#define LTDC_G7_FUNC             209
#define LTDC_HSYNC_FUNC          210
#define LTDC_R0_FUNC             211
#define LTDC_R1_FUNC             212
#define LTDC_R2_FUNC             213
#define LTDC_R3_FUNC             214
#define LTDC_R4_FUNC             215
#define LTDC_R5_FUNC             216
#define LTDC_R6_FUNC             217
#define LTDC_R7_FUNC             218
#define LTDC_VSYNC_FUNC          219
#define MDIOS_MDC_FUNC           220
#define MDIOS_MDIO_FUNC          221
#define QUADSPI_BK1_IO0_FUNC     222
#define QUADSPI_BK1_IO1_FUNC     223
#define QUADSPI_BK1_IO2_FUNC     224
#define QUADSPI_BK1_IO3_FUNC     225
#define QUADSPI_BK1_NCS_FUNC     226
#define QUADSPI_BK2_IO0_FUNC     227
#define QUADSPI_BK2_IO1_FUNC     228
#define QUADSPI_BK2_IO2_FUNC     229
#define QUADSPI_BK2_IO3_FUNC     230
#define QUADSPI_BK2_NCS_FUNC     231
#define QUADSPI_CLK_FUNC         232
#define RCC_MCO_1_FUNC           233
#define RCC_MCO_2_FUNC           234
#define RTC_REFIN_FUNC           235
#define SAI1_FS_A_FUNC           236
#define SAI1_FS_B_FUNC           237
#define SAI1_MCLK_A_FUNC         238
#define SAI1_MCLK_B_FUNC         239
#define SAI1_SCK_A_FUNC          240
#define SAI1_SCK_B_FUNC          241
#define SAI1_SD_A_FUNC           242
#define SAI1_SD_B_FUNC           243
#define SAI2_FS_A_FUNC           244
#define SAI2_FS_B_FUNC           245
#define SAI2_MCLK_A_FUNC         246
#define SAI2_MCLK_B_FUNC         247
#define SAI2_SCK_A_FUNC          248
#define SAI2_SCK_B_FUNC          249
#define SAI2_SD_A_FUNC           250
#define SAI2_SD_B_FUNC           251
#define SDMMC1_CK_FUNC           252
#define SDMMC1_CMD_FUNC          253
#define SDMMC1_D0_FUNC           254
#define SDMMC1_D1_FUNC           255
#define SDMMC1_D2_FUNC           256
#define SDMMC1_D3_FUNC           257
#define SDMMC1_D4_FUNC           258
#define SDMMC1_D5_FUNC           259
#define SDMMC1_D6_FUNC           260
#define SDMMC1_D7_FUNC           261
#define SDMMC2_CK_FUNC           262
#define SDMMC2_CMD_FUNC          263
#define SDMMC2_D0_FUNC           264
#define SDMMC2_D1_FUNC           265
#define SDMMC2_D2_FUNC           266
#define SDMMC2_D3_FUNC           267
#define SDMMC2_D4_FUNC           268
#define SDMMC2_D5_FUNC           269
#define SDMMC2_D6_FUNC           270
#define SDMMC2_D7_FUNC           271
#define SPDIFRX_IN0_FUNC         272
#define SPDIFRX_IN1_FUNC         273
#define SPDIFRX_IN2_FUNC         274
#define SPDIFRX_IN3_FUNC         275
#define SPI1_MISO_FUNC           276
#define SPI1_MOSI_FUNC           277
#define SPI1_NSS_FUNC            278
#define SPI1_SCK_FUNC            279
#define SPI2_MISO_FUNC           280
#define SPI2_MOSI_FUNC           281
#define SPI2_NSS_FUNC            282
#define SPI2_SCK_FUNC            283
#define SPI3_MISO_FUNC           284
#define SPI3_MOSI_FUNC           285
#define SPI3_NSS_FUNC            286
#define SPI3_SCK_FUNC            287
#define SPI4_MISO_FUNC           288
#define SPI4_MOSI_FUNC           289
#define SPI4_NSS_FUNC            290
#define SPI4_SCK_FUNC            291
#define SPI5_MISO_FUNC           292
#define SPI5_MOSI_FUNC           293
#define SPI5_NSS_FUNC            294
#define SPI5_SCK_FUNC            295
#define SPI6_MISO_FUNC           296
#define SPI6_MOSI_FUNC           297
#define SPI6_NSS_FUNC            298
#define SPI6_SCK_FUNC            299
#define SYS_JTCK_SWCLK_FUNC      300
#define SYS_JTDI_FUNC            301
#define SYS_JTDO_SWO_FUNC        302
#define SYS_JTMS_SWDIO_FUNC      303
#define SYS_JTRST_FUNC           304
#define SYS_TRACECLK_FUNC        305
#define SYS_TRACED0_FUNC         306
#define SYS_TRACED1_FUNC         307
#define SYS_TRACED2_FUNC         308
#define SYS_TRACED3_FUNC         309
#define TIM10_CH1_FUNC           310
#define TIM11_CH1_FUNC           311
#define TIM12_CH1_FUNC           312
#define TIM12_CH2_FUNC           313
#define TIM13_CH1_FUNC           314
#define TIM14_CH1_FUNC           315
#define TIM1_BKIN_FUNC           316
#define TIM1_BKIN2_FUNC          317
#define TIM1_CH1_FUNC            318
#define TIM1_CH1N_FUNC           319
#define TIM1_CH2_FUNC            320
#define TIM1_CH2N_FUNC           321
#define TIM1_CH3_FUNC            322
#define TIM1_CH3N_FUNC           323
#define TIM1_CH4_FUNC            324
#define TIM1_ETR_FUNC            325
#define TIM2_CH1_FUNC            326
#define TIM2_CH2_FUNC            327
#define TIM2_CH3_FUNC            328
#define TIM2_CH4_FUNC            329
#define TIM2_ETR_FUNC            330
#define TIM3_CH1_FUNC            331
#define TIM3_CH2_FUNC            332
#define TIM3_CH3_FUNC            333
#define TIM3_CH4_FUNC            334
#define TIM3_ETR_FUNC            335
#define TIM4_CH1_FUNC            336
#define TIM4_CH2_FUNC            337
#define TIM4_CH3_FUNC            338
#define TIM4_CH4_FUNC            339
#define TIM4_ETR_FUNC            340
#define TIM5_CH1_FUNC            341
#define TIM5_CH2_FUNC            342
#define TIM5_CH3_FUNC            343
#define TIM5_CH4_FUNC            344
#define TIM8_BKIN_FUNC           345
#define TIM8_BKIN2_FUNC          346
#define TIM8_CH1_FUNC            347
#define TIM8_CH1N_FUNC           348
#define TIM8_CH2_FUNC            349
#define TIM8_CH2N_FUNC           350
#define TIM8_CH3_FUNC            351
#define TIM8_CH3N_FUNC           352
#define TIM8_CH4_FUNC            353
#define TIM8_ETR_FUNC            354
#define TIM9_CH1_FUNC            355
#define TIM9_CH2_FUNC            356
#define UART4_CTS_FUNC           357
#define UART4_DE_FUNC            358
#define UART4_RTS_FUNC           359
#define UART4_RX_FUNC            360
#define UART4_TX_FUNC            361
#define UART5_CTS_FUNC           362
#define UART5_DE_FUNC            363
#define UART5_RTS_FUNC           364
#define UART5_RX_FUNC            365
#define UART5_TX_FUNC            366
#define UART7_CTS_FUNC           367
#define UART7_DE_FUNC            368
#define UART7_RTS_FUNC           369
#define UART7_RX_FUNC            370
#define UART7_TX_FUNC            371
#define UART8_CTS_FUNC           372
#define UART8_DE_FUNC            373
#define UART8_RTS_FUNC           374
#define UART8_RX_FUNC            375
#define UART8_TX_FUNC            376
#define USART1_CK_FUNC           377
#define UART1_CK_FUNC            377
#define USART1_CTS_FUNC          378
#define UART1_CTS_FUNC           378
#define USART1_DE_FUNC           379
#define UART1_DE_FUNC            379
#define USART1_RTS_FUNC          380
#define UART1_RTS_FUNC           380
#define USART1_RX_FUNC           381
#define UART1_RX_FUNC            381
#define USART1_TX_FUNC           382
#define UART1_TX_FUNC            382
#define USART2_CK_FUNC           383
#define UART2_CK_FUNC            383
#define USART2_CTS_FUNC          384
#define UART2_CTS_FUNC           384
#define USART2_DE_FUNC           385
#define UART2_DE_FUNC            385
#define USART2_RTS_FUNC          386
#define UART2_RTS_FUNC           386
#define USART2_RX_FUNC           387
#define UART2_RX_FUNC            387
#define USART2_TX_FUNC           388
#define UART2_TX_FUNC            388
#define USART3_CK_FUNC           389
#define UART3_CK_FUNC            389
#define USART3_CTS_FUNC          390
#define UART3_CTS_FUNC           390
#define USART3_DE_FUNC           391
#define UART3_DE_FUNC            391
#define USART3_RTS_FUNC          392
#define UART3_RTS_FUNC           392
#define USART3_RX_FUNC           393
#define UART3_RX_FUNC            393
#define USART3_TX_FUNC           394
#define UART3_TX_FUNC            394
#define USART6_CK_FUNC           395
#define UART6_CK_FUNC            395
#define USART6_CTS_FUNC          396
#define UART6_CTS_FUNC           396
#define USART6_DE_FUNC           397
#define UART6_DE_FUNC            397
#define USART6_RTS_FUNC          398
#define UART6_RTS_FUNC           398
#define USART6_RX_FUNC           399
#define UART6_RX_FUNC            399
#define USART6_TX_FUNC           400
#define UART6_TX_FUNC            400
#define USB_OTG_FS_DM_FUNC       401
#define USB_OTG_FS_DP_FUNC       402
#define USB_OTG_FS_ID_FUNC       403
#define USB_OTG_FS_SOF_FUNC      404
#define USB_OTG_HS_DM_FUNC       405
#define USB_OTG_HS_DP_FUNC       406
#define USB_OTG_HS_ID_FUNC       407
#define USB_OTG_HS_SOF_FUNC      408
#define USB_OTG_HS_ULPI_CK_FUNC  409
#define USB_OTG_HS_ULPI_D0_FUNC  410
#define USB_OTG_HS_ULPI_D1_FUNC  411
#define USB_OTG_HS_ULPI_D2_FUNC  412
#define USB_OTG_HS_ULPI_D3_FUNC  413
#define USB_OTG_HS_ULPI_D4_FUNC  414
#define USB_OTG_HS_ULPI_D5_FUNC  415
#define USB_OTG_HS_ULPI_D6_FUNC  416
#define USB_OTG_HS_ULPI_D7_FUNC  417
#define USB_OTG_HS_ULPI_DIR_FUNC 418
#define USB_OTG_HS_ULPI_NXT_FUNC 419
#define USB_OTG_HS_ULPI_STP_FUNC 420

