dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f76x_pinmux.h
	((gpio == PH07) && (func == ETH_RXD3_FUNC            )) ? 11 : \
	((gpio == PH07) && (func == FMC_SDCKE1_FUNC          )) ? 12 : \
	((gpio == PH07) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == FMC_D16_FUNC             )) ? 12 : \
	((gpio == PH08) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PH08) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == TIM12_CH2_FUNC           )) ?  9 : \
	((gpio == PH09) && (func == FMC_D17_FUNC             )) ? 12 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PH10) && (func == FMC_D18_FUNC             )) ? 12 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PH11) && (func == FMC_D19_FUNC             )) ? 12 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PH12) && (func == FMC_D20_FUNC             )) ? 12 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PH13) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PH13) && (func == FMC_D21_FUNC             )) ? 12 : \
	((gpio == PH13) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PH14) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PH14) && (func == FMC_D22_FUNC             )) ? 12 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == FMC_D23_FUNC             )) ? 12 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == FMC_D24_FUNC             )) ? 12 : \
	((gpio == PI00) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PI00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PI01) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PI01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == FMC_D25_FUNC             )) ? 12 : \
	((gpio == PI01) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PI01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == FMC_D26_FUNC             )) ? 12 : \
	((gpio == PI02) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PI02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == FMC_D27_FUNC             )) ? 12 : \
	((gpio == PI03) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == SAI2_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PI04) && (func == FMC_NBL2_FUNC            )) ? 12 : \
	((gpio == PI04) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PI04) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == SAI2_SCK_A_FUNC          )) ? 10 : \
	((gpio == PI05) && (func == FMC_NBL3_FUNC            )) ? 12 : \
	((gpio == PI05) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PI05) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == SAI2_SD_A_FUNC           )) ? 10 : \
	((gpio == PI06) && (func == FMC_D28_FUNC             )) ? 12 : \
	((gpio == PI06) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PI06) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == SAI2_FS_A_FUNC           )) ? 10 : \
	((gpio == PI07) && (func == FMC_D29_FUNC             )) ? 12 : \
	((gpio == PI07) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PI07) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PI09) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PI09) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PI09) && (func == FMC_D30_FUNC             )) ? 12 : \
	((gpio == PI09) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI10) && (func == ETH_RX_ER_FUNC           )) ? 11 : \
	((gpio == PI10) && (func == FMC_D31_FUNC             )) ? 12 : \
	((gpio == PI10) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI11) && (func == LTDC_G6_FUNC             )) ?  9 : \
	((gpio == PI11) && (func == USB_OTG_HS_ULPI_DIR_FUNC )) ? 10 : \
	((gpio == PI12) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI13) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PI15) && (func == LTDC_G2_FUNC             )) ?  9 : \
	((gpio == PI15) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PJ00) && (func == LTDC_R7_FUNC             )) ?  9 : \
	((gpio == PJ00) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PJ01) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PJ02) && (func == DSIHOST_TE_FUNC          )) ? 13 : \
	((gpio == PJ02) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PJ03) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PJ04) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PJ05) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PJ06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PJ07) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PJ08) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PJ09) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PJ10) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PJ11) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PJ12) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PJ12) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PJ13) && (func == LTDC_G4_FUNC             )) ?  9 : \
	((gpio == PJ13) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PJ14) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PJ15) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PK00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PK01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PK02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PK03) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PK04) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PK05) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PK06) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PK07) && (func == LTDC_DE_FUNC             )) ? 14 : \
	AF_NO_SUCH_PINFUNC)

